"use strict";

/////////////////////////////

alert(1 && null && 2); // null

alert(null || (2 && 3) || 4); // 3

/////////////////////////////

if (-1 || 0) alert("first"); // Выполнится, потому что - 1 это true
console.log(Boolean(-1)); // true

/////////////////////////////

if (-1 && 0) alert("second"); // Не выполнится, потому что 0 это false

////////////////////////////

if (null || (-1 && 1)) alert("third"); // Выполнится

////////////////////////////

let age = prompt("What is your age ?");

if (age >= 14 && age <= 90) {
    alert("Правильно!")
}

// 2.1

if (!age <= 14 || age <= 90) {
    alert("Не правильно!")
}

// 2.2

if (age <= 90 && age >= 14) {
    alert("Не подходит!")
}